# Materials to consume
Python for data analysis - Wes McKinney (indepth)
Learning the pandas Library - Matt Harrison (quick)

Planetpython.org (rss feed)

Python bytes by Michael Kennedy (podcast)
data skeptic Podcast

# Series data structure in pandas

In [3]:
import pandas as pd

In [4]:
#a series is a mixture between a list and a dictionary, where a series has a key and a value 
#but each column has its own attribute
#but think of the keys as the index in a series

#creating a series from a made list
books = ["hunger games", "harry potter","alice in wonderland"]
print(pd.Series(books))
print('-------------------------------------------------')
print("we can see here, since a list does not have any keys or indices. \n the series creates an index numerically (0,1,2)")
print('-------------------------------------------------')
print('notice that the series type is object since we passed in strings')

0           hunger games
1           harry potter
2    alice in wonderland
dtype: object
-------------------------------------------------
we can see here, since a list does not have any keys or indices.
 the series creates an index numerically (0,1,2)
-------------------------------------------------
notice that the series type is object since we passed in strings

In [5]:
#what if we passed in strings
numbers = [1,2,3,4,5]
print(pd.Series(numbers))
print('-------------------------------------------------')
print('we can see here that the type changed to int. \n what if there was a float in one of them?')
numbers = [1.1,2,3,4,5]
print(pd.Series(numbers))
print('-------------------------------------------------')
print('since integers are maskable, the series type gets turned into floats')

0    1
1    2
2    3
3    4
4    5
dtype: int64
-------------------------------------------------
we can see here that the type changed to int.
 what if there was a float in one of them?
0    1.1
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64
-------------------------------------------------
since integers are maskable, the series type gets turned into floats

In [6]:
#NaN and None
#when a series is created using strings and contains a missing object,
#it is referred to as None
books = ["hunger games", "harry potter","alice in wonderland", None]
print(pd.Series(books))
print('-------------------------------------------------')
print('if we pass a list of integers with the same None, this happens')
print('-------------------------------------------------')
numbers = [1.1,2,3,4,5,None]
print(pd.Series(numbers))
print('-------------------------------------------------')
print('the series gets masked automatically to Float \n this is done for mathematical reasons')

0           hunger games
1           harry potter
2    alice in wonderland
3                   None
dtype: object
-------------------------------------------------
if we pass a list of integers with the same None, this happens
-------------------------------------------------
0    1.1
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64
-------------------------------------------------
the series gets masked automatically to Float
 this is done for mathematical reasons

In [7]:
print("infact, no two NaN's are the same")
import numpy as np
print(np.nan == np.nan)
print("neither NaN is equal to None")
print(np.nan == None)

infact, no two NaN's are the same
False
neither NaN is equal to None
False

In [8]:
#panda's series deal with missing data differently
#for example if the series has a missing index, it will add it with a value of none
dict1 = {
    'adham' : 'Nile',
    'melad' : 'Nile',
    'dodo'  : 'Must'
}
print(pd.Series(dict1,index=['adham','melad','nashar']))
print('-------------------------------------------------')
print("we can see here, even though dodo had a value \n but his index was neglected since it wasn't call")
print("but even though nashar was not in the dict, his index was called/created hence the NaN")

adham     Nile
melad     Nile
nashar     NaN
dtype: object
-------------------------------------------------
we can see here, even though dodo had a value
 but his index was neglected since it wasn't call
but even though nashar was not in the dict, his index was called/created hence the NaN

# Query
the meaning of query is to ask a question when in doubt of something, similar to when we ask for the value of a certain index in a series.

In [15]:
#Loc and ILoc 
#to index an entry in a series, you can index it using its numerical automated indexing 
#or the by pulling the actual index name

series = pd.Series({
        'adham' : 'Nile',
        'melad' : 'Nile',
        'dodo'  : 'Must'
})

#I-loc (integer Loc)
print("iloc method: ",series.iloc[2])
#we queried the value of the "3rd" entry by its numerical value

#loc (object)
print("loc method: ",series.loc["adham"])

iloc method:  Must
loc method:  Nile

In [27]:
# you can query an entry by its index numerically or objectively automatically without loc or Iloc too
#but be aware when you have a dataset that contains integers as its index
series = pd.Series({
    101:'english-101',
    102:'english-102',
    201:'english-201',
    202:'english-202'
})
try:
    series[0]
except:
    print("calling an integer-indexed dataset using numerical indexing caused confusion")
print(series.iloc[0])
print(series.loc[101])

calling an integer-indexed dataset using numerical indexing caused confusion
english-101
english-101

In [33]:
#loc and ILoc can create new data and even change it
#thankfully, loc and Iloc cannot create a new data entry without an actual value
series = pd.Series({
        'adham' : 'Nile',
        'melad' : 'Nile',
        'dodo'  : 'Must',
        'khaled': 'Nile'
})
series.loc['ashraf'] = 'GUC' #created a new data index
series.loc['khaled'] = 'Must' #changed the value of an existing data index
print(series)

adham     Nile
melad     Nile
dodo      Must
khaled    Must
ashraf     GUC
dtype: object

In [40]:
#you can also append series as you do in lists.
uni = pd.Series({
        'adham' : 'Nile',
        'melad' : 'Nile',
        'dodo'  : 'Must',
        'khaled': 'Nile'
})
gpa = pd.Series({
        'adham' : 3.0,
        'melad' : 3.6,
        'dodo'  : 3.0,
        'khaled': 2.9
})
appended = uni.append(gpa)
print(appended)
print('-------------------------------------------------')
print('printing my data only')
print(appended.loc['adham'])
print('appending a series with another creates another series \n instead of manipulating the existing ones')
print('-------------------------------------------------')
print('when [loc]ating a data entry with multiple indicies, it will return a new formed series')
print('---printing the previous series type---')
print(type(appended.loc['adham']))

adham     Nile
melad     Nile
dodo      Must
khaled    Nile
adham        3
melad      3.6
dodo         3
khaled     2.9
dtype: object
-------------------------------------------------
printing my data only
adham    Nile
adham       3
dtype: object
appending a series with another creates another series
 instead of manipulating the existing ones
-------------------------------------------------
when [loc]ating a data entry with multiple indicies, it will return a new formed series
---printing the previous series type---
<class 'pandas.core.series.Series'>

# The power of vectorization
I wont go to much details about the importance of vectorization but all you need to know that it's significantly faster than traditional programming. so whenever you catch your self iterating on a huge dataset one by one to execute some kind of function, remember that you can treat the whole dataset as vectors which would allow to parallel computer, hence faster results.

# series.Head()
It prints the first 5 indices in the dataset

# dataframes, matrices of pandas
you can think of a dataframe as a matrix but with labels mandatory labels for the columns and optional set labels for the rows

In [55]:
#first I created a few series for each student marks along the semester
adham = pd.Series({
    'assign1' : 9,
    'assign2' : 5,
    'assign3' : 4,
    'quiz1' : 10,
    'quiz2' : 1,
    'final' : 40
})
melad = pd.Series({
    'assign1' : 10,
    'assign2' : 8,
    'assign3' : 7,
    'quiz1' : 2,
    'quiz2' : 10,
    'final' : 38
})
nashar = pd.Series({
    'assign1' : 5,
    'assign2' : 10,
    'assign3' : 10,
    'quiz1' : 8,
    'quiz2' : 7,
    'final' : 35
})
nashar1 = pd.Series({
    'assign1' : 0,
    'assign2' : 3,
    'assign3' : 10,
    'quiz1' : 4,
    'quiz2' : 1,
    'final' : 0
})
#then added all series in the datadframe while adding their names as index
df = pd.DataFrame([adham,melad,nashar,nashar1], index=['adham','melad','nashar','nashar'])
print(df)
print('dataframes can take a list of dictionaries directly instead of a list of series')

        assign1  assign2  assign3  quiz1  quiz2  final
adham         9        5        4     10      1     40
melad        10        8        7      2     10     38
nashar        5       10       10      8      7     35
nashar        0        3       10      4      1      0
dataframes can take a list of dictionaries directly instead of a list of series

In [56]:
#lets see what happens when we call the record of adham
print(df.loc['adham'])
print('-------------------------------------------------')
print('when extracting a row from a dataframe, it creates a series instance of the row')
print("the type of the extracted row ->>",type(df.loc['adham']))

assign1     9
assign2     5
assign3     4
quiz1      10
quiz2       1
final      40
Name: adham, dtype: int64
-------------------------------------------------
when extracting a row from a dataframe, it creates a series instance of the row
the type of the extracted row ->> <class 'pandas.core.series.Series'>

In [61]:
#however when extracting a dataentry that has multiple indicies 
#(students with multiple id's for for ex)
#it returns a dataframe fit with all series collected.
print(df.loc['nashar'])
print('-------------------------------------------------')

print("the type of the extracted row ->>",type(df.loc['nashar']))

        assign1  assign2  assign3  quiz1  quiz2  final
nashar        5       10       10      8      7     35
nashar        0        3       10      4      1      0
-------------------------------------------------
the type of the extracted row ->> <class 'pandas.core.frame.DataFrame'>

In [84]:
#you can also select specific data when assign the column and the rows in loc
print(df.loc['nashar','final'])
print((df.loc['nashar','final']).equals((df.loc['nashar']['final'])))
print('-------------------------------------------------')
print('here the type of the extraction is a series since "nashar" has multiple indices in the dataframe')
print("the type of the extracted row ->>",type(df.loc['nashar']['final']))

nashar    35
nashar     0
Name: final, dtype: int64
True
-------------------------------------------------
here the type of the extraction is a series since "nashar" has multiple indices in the dataframe
the type of the extracted row ->> <class 'pandas.core.series.Series'>

In [71]:
print(df.loc['melad']['final'])
print('-------------------------------------------------')
print('''distinctively, when extracting information from a data entry with a singular indicies /n
      it returns the variable type inside the cell ''')
print("the type of the extracted row ->>",type(df.loc['melad']['final']))

38
-------------------------------------------------
distinctively, when extracting information from a data entry with a singular indicies /n
      it returns the variable type inside the cell
the type of the extracted row ->> <class 'numpy.int64'>

# what if you wanted to collect columns instead of row?

In [74]:
#you can transpose the dataframe! exchanging the rows with the columns to perform the same methods
print(df.T.loc['final'])
print('-------------------------------------------------')
print('it will return the final grades of each student in the dataframe')

adham     40
melad     38
nashar    35
nashar     0
Name: final, dtype: int64
-------------------------------------------------
it will return the final grades of each student in the dataframe

In [85]:
#we know that loc and Iloc selects data from rows
#when we use the indexing operator "[]" directly on the dataframe, it targets the COLUMNS
print(df['final'])
print('-------------------------------------------------')
print('same result in the previous code!')
print("and since we are extracting a singular column, the type will be ->>",type(df['final']))
print("bool checking if the both dataframes are similar ->>",(df['final']).equals(df.T.loc['final']))

adham     40
melad     38
nashar    35
nashar     0
Name: final, dtype: int64
-------------------------------------------------
same result in the previous code!
and since we are extracting a singular column, the type will be ->> <class 'pandas.core.series.Series'>
bool checking if the both dataframes are similar ->> True

In [102]:
#we can also slice the dataframe
print(df.iloc[1:,-3:])
print('-------------------------------------------------')
print('here we extracted the quizzes and final grades for all students, exluding me, the first indices')

        quiz1  quiz2  final
melad       2     10     38
nashar      8      7     35
nashar      4      1      0
-------------------------------------------------
here we extracted the quizzes and final grades for all students, exluding me, the first indices

# deleting data!

In [106]:
#drop
print(df.drop('nashar'))
print('-------------------------------------------------')
print('dropping all nashar data')

       assign1  assign2  assign3  quiz1  quiz2  final
adham        9        5        4     10      1     40
melad       10        8        7      2     10     38
-------------------------------------------------
dropping all nashar data

In [123]:
#what if we wanted to drop a column?
#yes we can transpose, delete the column(pseudo row) then transpose back
#but we can use the drop function and setting the axis setting to 1,
#to inform the function that it will drop a column not a row
#and we will give it an inplace which will change the original dataframe instead of manipulating it
copy_df = df.copy()
copy_df.drop("quiz2",inplace=True,axis=1)
print(copy_df)
print('-------------------------------------------------')
print('dropping all quiz2 data')

        assign1  assign2  assign3  quiz1  final
adham         9        5        4     10     40
melad        10        8        7      2     38
nashar        5       10       10      8     35
nashar        0        3       10      4      0
-------------------------------------------------
dropping all quiz2 data

In [124]:
#another method of deleting a columns that's as risky
#del, it deletes the column instantly in the original dataframe
del copy_df['quiz1']
print(copy_df)

        assign1  assign2  assign3  final
adham         9        5        4     40
melad        10        8        7     38
nashar        5       10       10     35
nashar        0        3       10      0

In [128]:
# we can also create new columns with a unified value for data entries
df['bonus'] = 100 
df

        assign1  assign2  assign3  quiz1  quiz2  final  markupQuiz  bonus
adham         9        5        4     10      1     40           1    100
melad        10        8        7      2     10     38           1    100
nashar        5       10       10      8      7     35           1    100
nashar        0        3       10      4      1      0           1    100

# PANDAS DOES NOT MANIPULATE THE ORIGINAL DATAFRAME WHEN FUNCTIONS APPLIED
a copy of the dataframe gets manipulated instead of the original one

# opening csv files

In [137]:
#using the read_csv command
df = pd.read_csv('Admission_predict.csv')
df

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...,...
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [139]:
#we can see that we already have a column that we can use as an indexing column
#we will use the index_col attribute while reading the csv file
df = pd.read_csv('Admission_predict.csv', index_col=0)
df

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

In [142]:
# we can also rename columns in the csv files using the rename command
#here we will strip the column names from any unneccessary space that might 
new_df = df.rename(mapper=str.strip, axis= 'columns')
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR', 'CGPA',
       'Research', 'Chance of Admit'],
      dtype='object')

In [145]:
#lets say we want to make all letters lower case
cols=list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns = cols
df

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

# boolean query!

In [160]:
df = pd.read_csv('Admission_predict.csv', index_col=0)
cols=list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns = cols
print('you can do it the traditiional way')
print(df['chance of admit'] > 0.7)
print('-------------------------------------------------')

you can do it the traditiional way
Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool
-------------------------------------------------

In [161]:
print('we can then apply the boolean series on the dataframe to rule out the false')

print('-------------------------------------------------')
df.where(df['chance of admit'] > 0.7).head()

we can then apply the boolean series on the dataframe to rule out the false
-------------------------------------------------

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [162]:
print('we can then remove the NaN data entries from the dataset')
print('-------------------------------------------------')
df.where(df['chance of admit'] > 0.7).dropna().head()

we can then remove the NaN data entries from the dataset
-------------------------------------------------

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
6,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90

In [163]:
print('we can do both in one step using overloading')
print('-------------------------------------------------')
df[df['chance of admit'] > 0.7].head()

we can do both in one step using overloading
-------------------------------------------------

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90

In [ ]:
# combining bools

In [166]:
#in pandas you cant use the keywords and/or instead you need to use the & or |
#use parenthathese!!!
(df['chance of admit'] > 0.7) & (df['chance of admit'] < 0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [169]:
#you can use built in bool functions in pandas like gt (greater than) or lt (less than)
df['chance of admit'].gt(0.7) & df['chance of admit'].lt(0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [170]:
#sicne they are built in functions, you can chain them
df['chance of admit'].gt(0.7).lt(0.9)

Serial No.
1      False
2      False
3      False
4      False
5       True
       ...
396    False
397    False
398    False
399     True
400    False
Name: chance of admit, Length: 400, dtype: bool

In [ ]:
print('uploading to github')